# TagText Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IndependentTag..::..TagText Property
IndependentTag Class See Also
---
The text associated with the tag. If there are several strings assiciated with the tag, the strings will be returned concatenated.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string TagText { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TagText As String
	Get
```

Visual C++
---
```text
public:
property String^ TagText {
	String^ get ();
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The IndependentTag object does not have a tag behavior. -or- The tagging element is in the link. |

# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace